# define_design_lib WORK -path $WORK_PATH

read_ddc        ${DDC_PATH}/design.ddc 
current_design  Mcu
link_design     Mcu